# Отчёт по лабораторной работе №15 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Былькова Кристина Алексеевна, № по списку 2</ins> 

<b>Контакты e-mail:</b> <ins>kristina.bilckova@yandex.ru</ins>

<b>Работа выполнена:</b> «29» <ins>октября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «29» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Обработка матриц
## 2. Цель работы
Составить программу на языке Си, производящую обработку квадратной матрицы порядка NxN (1 <= N <= 8), из целых чисел, вводимой из стандартного входного текстового файла.
## 3. Задание (вариант № 2)
Замена всех максимальных элементов матрицы на чисто столбцов, содержащих её минимальный элемент.
## 4. Оборудование:
<b>Процессор:</b> AMD Ryzen9-5900HS, 8 ядер

<b>ОП:</b> 16gb

<b>SSD:</b> 1 Tb SSD

<b>Монитор:</b> 15.6" - 2560x1440

<b>Графика:</b> NV GeForce RTX 3080

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS

<b>Интерпретатор команд:</b> bash версия 4.4.19

<b>Система программирования:</b> -

<b>Редактор текстов:</b> emacs версия 25.2.2

<b>Утилиты операционной системы:</b> -

<b>Прикладные системы и программы:</b> gcc

<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/kristina

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
1. Ввод размера матрицы; 
2. Создание матрицы;
3. Написание функций, необходимых для выполнения задачи;
4. Вывод ответа.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
#include <stdio.h>
#include <stdlib.h>

#define MAX_N (8)

int max(int matrix[], int n) {
  int max_elem = -1e9;
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      if (matrix[i * n + j] > max_elem)
        max_elem = matrix[i * n + j];
    }
  }
  return max_elem;
}

int min(int matrix[], int n) {
  int min_elem = 1e9;
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      if (matrix[i * n + j] < min_elem)
        min_elem = matrix[i * n + j];
    }
  }
  return min_elem;
}

int columns_count(int matrix[], int n, int min_elem) {
  int count = 0;
  for (int j = 0; j < n; j++){
    int k = 0;
    for (int i = 0; i < n; i++) {
      if (matrix[i * n + j] == min_elem)
        ++k;
      //printf("%d ", matrix[i * n + j]);
    }
  //printf("\n");
  if (k > 0)
    ++count;
  }
  return count;
}

int replace(int matrix[], int n, int max_elem, int count) {
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      if (matrix[i * n + j] == max_elem)
        matrix[i * n + j] = count;
    }
  }
  return *matrix;
}

int main() {
  int n;
  printf("Matrix size: ");
  scanf("%d", &n);
  int matrix[MAX_N * MAX_N];
  printf("Matrix:\n");
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      scanf("%d", &matrix[i * n + j]);
    }
  }
  //max
  int max_elem = max(matrix, n);
  printf("Max elem: %d", max_elem);
  printf("\n");
  //min
  int min_elem = min(matrix, n);
  printf("Min elem: %d", min_elem);
  printf("\n");
  //count
  int count = columns_count(matrix, n, min_elem);
  printf("Number of columns with min_elem: %d", count);
  printf("\n");
  //replace
  replace(matrix, n, max_elem, count);
  //output
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      printf("%d ", matrix[i * n + j]);
    }
    printf("\n");
  }
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
kristina@kristina-VirtualBox:~/Рабочий стол/lab15$ cc -g lab15.c
kristina@kristina-VirtualBox:~/Рабочий стол/lab15$ ./a.out
Matrix size: 8
Matrix:
2 4 3 9 3 0 8 4 
4 4 8 8 0 1 6 4 
2 2 7 9 6 2 4 1 
5 0 4 9 4 6 1 9 
0 4 8 5 7 8 0 1 
2 0 1 2 3 9 8 7 
4 5 6 0 9 1 3 5 
3 8 6 7 6 7 8 8 
Max elem: 9
Min elem: 0
Number of columns with min_elem: 6
2 4 3 6 3 0 8 4 
4 4 8 8 0 1 6 4 
2 2 7 6 6 2 4 1 
5 0 4 6 4 6 1 6 
0 4 8 5 7 8 0 1 
2 0 1 2 3 6 8 7 
4 5 6 0 6 1 3 5 
3 8 6 7 6 7 8 8 
kristina@kristina-VirtualBox:~/Рабочий стол/lab15$ ./a.out
Matrix size: 4
Matrix:
3 3 5 0 
4 9 9 3 
6 9 8 3 
0 9 6 6 
Max elem: 9
Min elem: 0
Number of columns with min_elem: 2
3 3 5 0 
4 2 2 3 
6 2 8 3 
0 2 6 6 
kristina@kristina-VirtualBox:~/Рабочий стол/lab15$ ./a.out
Matrix size: 2
Matrix:
1 3 
5 3 
Max elem: 5
Min elem: 1
Number of columns with min_elem: 1
1 3 
1 3
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 29.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
```
-
```
## 11. Выводы

Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и обработки их элементов.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
