# Отчёт по лабораторной работе №14 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Былькова Кристина Алексеевна, № по списку 2</ins> 

<b>Контакты e-mail:</b> <ins>kristina.bilckova@yandex.ru</ins>

<b>Работа выполнена:</b> «29» <ins>октября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins> </ins>

<b>Отчет сдан</b> «29» <ins>октября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins> </ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц.
## 2. Цель работы
Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода) с помощью вложенных циклов с переменными границами.
## 3. Задание (вариант № 2)
Печать элементов матрицы по диагоналям, параллельным главной, с правого верхнего угла в левый нижний.
## 4. Оборудование:
<b>Процессор:</b> AMD Ryzen9-5900HS, 8 ядер

<b>ОП:</b> 16gb

<b>SSD:</b> 1 Tb SSD

<b>Монитор:</b> 15.6" - 2560x1440

<b>Графика:</b> NV GeForce RTX 3080

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS

<b>Интерпретатор команд:</b> bash версия 4.4.19

<b>Система программирования:</b> -

<b>Редактор текстов:</b> emacs версия 25.2.2

<b>Утилиты операционной системы:</b> -

<b>Прикладные системы и программы:</b> gcc

<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/kristina

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
1. Ввод размера матрицы; 
2. Создание матрицы;
3. Циклы для прохода по матрице;
4. Вывод ответа.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
```
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>
#include <stddef.h>
#include <time.h>

#define MAX_N (7)

int main() {
  srand(time(0));
  int n;
  printf("Matrix size: ");
  scanf("%d", &n);
  int matrix[MAX_N][MAX_N];
  int i, j, k;
  printf("Matrix:\n");
  for (i = 0; i < n; i++){
    for (j = 0; j < n; j++) {
      //scanf("%d", &matrix[i][j]);
      matrix[i][j] = rand() % 10;
      printf("%d ", matrix[i][j]);
    }
    printf("\n");
}
  printf("Out: ");
  for (i = n - 1; i >= 0; i-- ) {
    for (j = i, k = 0; j < n; j++, k++) {
      printf("%d ", matrix[k][j]);
    }
  }
  for (i = 1; i < n; i++) {
    for (j = 0, k = i; k < n; j++, k++) {
      printf("%d ", matrix[k][j]);
    }
  }
    printf("\n");
    return 0;
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ cc -g lab14.c
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ ./a.out
Matrix size: 5
Matrix:
9 9 8 7 7 
8 9 9 1 5 
7 7 1 5 8 
3 6 1 6 3 
9 4 2 5 1 
Out: 7 7 5 8 1 8 9 9 5 3 9 9 1 6 1 8 7 1 5 7 6 2 3 4 9 
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ ./a.out
Matrix size: 3
Matrix:
5 4 2 
5 6 9 
8 9 3 
Out: 2 4 9 5 6 3 5 9 8 
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ ./a.out
Matrix size: 7
Matrix:
4 8 1 9 4 9 7 
8 3 4 6 3 8 9 
5 6 3 4 8 0 3 
7 6 1 7 0 9 2 
7 5 9 1 3 2 2 
7 1 2 7 6 8 3 
0 7 5 7 5 8 3 
Out: 7 9 9 4 8 3 9 3 0 2 1 6 8 9 2 8 4 4 0 2 3 4 3 3 7 3 8 3 8 6 1 1 6 8 5 6 9 7 5 7 5 2 7 7 1 5 7 7 0 
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ ./a.out
Matrix size: 2
Matrix:
8 6 
1 0 
Out: 6 8 0 1  
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 29.10.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Выполнение дополнительного задания.
```
-
```
## 11. Выводы

Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и печати в строку всех их элементов.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
