# Отчёт по лабораторной работе №14 по курсу "Фундаментальная информатика"

<b>Студент группы:</b> <ins>М80-108Б-22 Былькова Кристина Алексеевна, № по списку 2</ins> 

<b>Контакты e-mail:</b> <ins>kristina.bilckova@yandex.ru</ins>

<b>Работа выполнена:</b> «26» <ins>ноября</ins> <ins>2022</ins> г.

<b>Преподаватель:</b> <ins>асп. каф. 806 Сахарин Никита Александрович</ins>

<b>Входной контроль знаний с оценкой:</b> <ins>5 (отлично)</ins>

<b>Отчет сдан</b> «26» <ins>ноября</ins> <ins>2022</ins> г., <b>итоговая оценка</b> <ins>5 (отлично)</ins>

<b>Подпись преподавателя:</b> ________________

## 1. Тема
Вложенные циклы с параметрами. Обход и линеаризация матриц.
## 2. Цель работы
Составить программу ввода квадратной матрицы и печати в строку всех её элементов в заданном ниже порядке следования (обхода) с помощью вложенных циклов с переменными границами.
## 3. Задание (вариант № 2)
Печать элементов матрицы по диагоналям, параллельным главной, с правого верхнего угла в левый нижний.
## 4. Оборудование:
<b>Процессор:</b> AMD Ryzen9-5900HS, 8 ядер

<b>ОП:</b> 16gb

<b>SSD:</b> 1 Tb SSD

<b>Монитор:</b> 15.6" - 2560x1440

<b>Графика:</b> NV GeForce RTX 3080

## 5. Программное обеспечение:
<b>Операционная система семейства:</b> VirtualBox 6.1.38 - Ubuntu 22.04.01 LTS

<b>Интерпретатор команд:</b> bash версия 4.4.19

<b>Система программирования:</b> -

<b>Редактор текстов:</b> emacs версия 25.2.2

<b>Утилиты операционной системы:</b> -

<b>Прикладные системы и программы:</b> gcc

<b>Местонахождение и имена файлов программ и данных на домашнем компьютере:</b> /home/kristina

## 6. Идея, метод, алгоритм решения задачи (в формах: словесной, псевдокода, графической [блок-схема, диаграмма, рисунок, таблица] или формальные спецификации с пред- и постусловиями)
1. Ввод размера матрицы; 
2. Создание матрицы;
3. Циклы для прохода по матрице;
4. Вывод ответа.

## 7. Сценарий выполнения работы [план работы, первоначальный текст программы в черновике (можно на отдельном листе) и тесты либо соображения по тестированию]. 
``` :src/lab14.c
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

#define MAX_N (7)

void diag(int d, int n, int (*matrix)[n]);

int main() {
  int n;
  scanf("%d", &n);
  int matrix[MAX_N * MAX_N];
  int i, j, k;
  for (i = 0; i < n; i++) {
    for (j = 0; j < n; j++) {
      scanf("%d", &matrix[i * n + j]);
    }
  }
  for (int d = 1; d < n*2; d++) {
    diag(d, n, (int (*)[n]) matrix);
  }
  printf("\n");
  return 0;
}

void diag(int d, int n, int (*matrix)[n]) {
  int i, j, k;
  int t = 1;
  for (i = n - 1; i >= 0; i--) {
    for (j = i, k = 0; j < n; j++, k++) {
        if (t == d) printf("%d ", matrix[k][j]);
    }
    ++t;
  }
  for (i = 1; i < n; i++) {
    for (j = 0, k = i; k < n; j++, k++) {
      if (t == d) printf("%d ", matrix[k][j]);
    }
    ++t;
  }
}
```

Пункты 1-7 отчета составляются сторого до начала лабораторной работы.
Допущен к выполнению работы.  
<b>Подпись преподавателя:</b> ________________
## 8. Распечатка протокола 
```
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ cc -g lab14.c && ./a.out
7
1 2 3 4 5 6 7
8 9 10 11 12 13 14
15 16 17 18 19 20 21 
22 23 24 25 26 27 28
29 30 31 32 33 34 35
36 37 38 39 40 41 42
43 44 45 46 47 48 49
7 6 14 5 13 21 4 12 20 28 3 11 19 27 35 2 10 18 26 34 42 1 9 17 25 33 41 49 8 16 24 32 40 48 15 23 31 39 47 22 30 38 46 29 37 45 36 44 43 
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ cc -g lab14.c && ./a.out
4
1 2 3 4
5 6 7 8
9 10 11 12
13 14 15 16
4 3 8 2 7 12 1 6 11 16 5 10 15 9 14 13 
kristina@kristina-VirtualBox:~/Рабочий стол/lab14$ cc -g lab14.c && ./a.out
2
1 2
3 4
2 1 4 3 
```
## 9. Дневник отладки должен содержать дату и время сеансов отладки и основные события (ошибки в сценарии и программе, нестандартные ситуации) и краткие комментарии к ним. В дневнике отладки приводятся сведения об использовании других ЭВМ, существенном участии преподавателя и других лиц в написании и отладке программы.

| № |  Лаб. или дом. | Дата | Время | Событие | Действие по исправлению | Примечание |
| ------ | ------ | ------ | ------ | ------ | ------ | ------ |
| 1 | дом. | 26.11.22 | 13:00 | Выполнение лабораторной работы | - | - |
## 10. Замечания автора по существу работы — Написание команд для отработки навыков работы в ОС UNIX.
Печать элементов матрицы по спиралям.
``` :src/lab14-1.c
#include <stdio.h>
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <stdlib.h>

#define MAX_N (7)

void spiral(int number, int n, int (*matrix)[n]);

int main() {
  int n;
  scanf("%d", &n);
  int matrix[MAX_N * MAX_N];
  for (int i = 0; i < n; i++){
    for (int j = 0; j < n; j++) {
      scanf("%d", &matrix[i * n + j]);
    }
  }
  int number = 1;
  spiral(number, n, (int (*)[n]) matrix);
  printf("\n");
  return 0;
}

void spiral(int number, int n, int (*matrix)[n]) {
  int l = n;
  int p = 0;
  int i = 0, j = -1;
  int temp[4] = { 1, 0, -1, 0 };
  ++number;
  while (l != 0) {
    if (i == j && (i != n - 1 && j != n - 1)) {
      ++number;
    }
    for (int k = 0; k != l; ++k) {
        j += temp[p % 4];
        i += temp[(p + 3) % 4];
        printf("%d ", matrix[i][j]);
    }
    ++p;
    l -= p % 2;
  }
}
```
## 11. Выводы

Была написана программа на языке на Си, выполняющая указанное вариантом действие над квадратной матрицей. В результате выполнения работы, были приобретены навыки для работы с квадратными матрицами и печати в строку всех их элементов.

Недочёты при выполнении задания могут быть устранены следующим образом: —

<b>Подпись студента:</b> ____________________
